Revit 2024 API
BuiltInFailures.LooseDimensionFailures.LooseCurtainWallData Property
 Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LooseCurtainWallData { get; }
Visual Basic
Public Shared ReadOnly Property LooseCurtainWallData As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LooseCurtainWallData {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace